Revit 2020 API
CylindricalSurface.YDir Property
 X axis of the local coordinate system associated with this cylinder.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2017
Syntax
C#
public XYZ YDir { get; }
Visual Basic
Public ReadOnly Property YDir As XYZ
	Get
Visual C++
public:
property XYZ^ YDir {
	XYZ^ get ();
}
See Also
CylindricalSurface Class
Autodesk.Revit.DB Namespace